{
    "content": "What is the Business Analysis School?\nThe Business Analysis School is an EdTech learning academy founded by Eno Eka under ENY Consulting Inc. It helps non-tech professionals pivot into the tech industry through Business Analysis, Product Management, and Project Management. It is an IIBA Endorsed Education Provider and ScrumStudy Authorized Training Provider, offering courses and certifications to grow income to six figures using Agile Business Analysis skills.\n\nWho founded the Business Analysis School?\nThe school was founded by Eno Eka, an award-winning career coach, Business Analyst, and Change Manager. She transitioned from accounting to Business Analysis, achieving a six-figure income, and has helped over 20,000 professionals globally kick-start their careers.\n\nWhat programs does the Business Analysis School offer?\nWe offer a variety of programs including Coaching Programs, Certification Classes, On-Demand Courses, Online Self-Study Certifications, and Career Services. Specific offerings include foundational 15-hour online courses, 2-week certification prep courses, Strategic Business Analysis Masterclasses, and free masterclasses like '7 Steps to Grow Your Income to 6 Figures Without a Technical Degree'.\n\nWhat certifications can I earn through the school?\nCertifications include Entry Certificate in Business Analysis (ECBA), Certification of Capability in Business Analysis (CCBA), Certified Business Analysis Professional (CBAP), Scrum Master Certified (SMC), Scrum Product Owner Certified (SPOC), Scrum Agile Master Certified (SAMC), Six Sigma Green Belt (SSGB), and Six Sigma Black Belt (SSBB).\n\nDo I need a technical degree or experience to enroll?\nNo, our programs are designed for non-tech professionals. You can leverage your existing skills and experience to transition into Business Analysis without a technical degree or prior experience.\n\nWhat is the duration of the programs?\nProgram durations vary. For example, our foundational course is 15 hours of online content, while the Business Analysis Certification Prep Course is a 2-week intensive program. Masterclasses are typically shorter, live sessions, and on-demand courses allow self-paced learning.\n\nWhat is included in the certification prep course?\nThe 2-week Business Analysis Certification Prep Course includes step-by-step coaching, lifetime access to materials, 35 Professional Development Units (PDUs) for IIBA, free bonuses like a book, and an additional 40 IIBA PD hours.\n\nHow is the curriculum structured?\nCourses include videos, assessments, downloadable PDFs, quizzes, and practical assignments. They align with global best practices like IIBA's BABOK Guide and Scrum frameworks, covering topics such as Agile, Scrum, Lean, Six Sigma, and Product Management.\n\nAre the courses online or in-person?\nAll courses are delivered online, with options for live sessions, on-demand access, and self-study. This allows flexibility for global students.\n\nWhat are the enrollment requirements?\nThere are no strict prerequisites, but a passion for career growth and basic professional experience is recommended. Enrollment is open to professionals from any background looking to upskill in Business Analysis.\n\nHow do I enroll in a program?\nVisit our website at https://www.businessanalysisschool.com/ or https://course.businessanalysisschool.com/ to sign up. You can register for free masterclasses or paid programs directly online. For inquiries, use the contact form on https://www.enyconsulting.ca/contact, and expect a response within 24 hours.\n\nWhat is the cost of the programs?\nPricing varies by program. For example, the IIBA Business Analysis Certifications for Europe, Middle East, and Africa Program is $297. Other courses range from free masterclasses to comprehensive programs costing several hundred dollars. Check the specific course page for current pricing.\n\nAre there payment plans or scholarships available?\nYes, we offer scholarships, such as the annual Black History Month giveaway worth $297 per recipient for certification courses. Payment plans may be available for select programs—contact us via the form for details. We also have occasional promotions and free training sessions.\n\nWhat payment methods do you accept?\nWe accept major credit cards, PayPal, and other secure online payment methods through our enrollment platform. All transactions are handled securely.\n\nIs there a refund policy?\nRefunds are available within a specified period (typically 7-14 days) if you haven't accessed significant course content. Please review the terms on the enrollment page or contact support for specifics.\n\nWhat career outcomes can I expect?\nGraduates often transition to six-figure jobs in Business Analysis without tech backgrounds. Many secure roles as Business Analysts, Project Managers, or in tech consulting, with increased income and job satisfaction. Testimonials highlight landing high-quality jobs and career transformations.\n\nHow does the school support career development?\nWe provide career services, mentorship from global BA professionals, networking in our community, job search tips via podcasts like 'Fireside Chat With Eno,' and preparation for certifications that enhance employability. Eno Eka's coaching focuses on immigrant professionals and career pivots.\n\nWhat do students say about the programs?\nTestimonials praise the programs for transforming careers: 'Eno is an amazing coach with incredible client results' (Julia Cha). Students like Funmi Adewuyi credit the guidance for success in BA roles at companies like Shaw Communications.\n\nAre there any success stories from alumni?\nYes, alumni have landed six-figure BA jobs post-training. For instance, scholarship winners advanced their careers through free certifications, and many non-tech professionals pivoted successfully into tech.\n\nWhat kind of student support is available?\nWe offer lifetime access to course materials, mentorship, community networking, and responsive support via email or contact form (within 24 hours). For complex queries, escalate to a human agent.\n\nHow can I contact support for more information?\nUse the contact form on https://www.enyconsulting.ca/contact or schedule a call via https://calendly.com/enyconsulting. Follow us on LinkedIn (https://www.linkedin.com/company/enyconsultinginc) or Instagram (https://www.instagram.com/enyconsulting) for updates.\n\nAre the courses aligned with industry standards?\nYes, courses are aligned with IIBA's BABOK Guide, ScrumStudy frameworks, and global best practices in Agile, Lean, and Six Sigma.\n\nCan I get PDUs or CDUs for certifications?\nYes, many courses provide Professional Development Units (PDUs) or Continuing Development Units (CDUs) for IIBA recertification, such as 35 PDUs in the prep course.\n\nIs there a community for students?\nYes, join our expanded global community to network with students and BA leaders worldwide.\n\nWhat if I have no experience in Business Analysis?\nOur programs are beginner-friendly, teaching foundational skills and providing step-by-step coaching to build your expertise.\n\nHow does Business Analysis help in career growth?\nBusiness Analysis skills enable you to bridge business and tech, solving problems, improving processes, and driving revenue—leading to high-demand, well-paid roles.\n\nAre there free resources available?\nYes, free masterclasses, blog articles on BA skills, and training sessions like the 'Six-Figure Business Analyst' guide.\n\nWhat industries do your programs prepare me for?\nPrograms prepare you for over 20 industries, including IT, finance, healthcare, and more, with ENY's team having 50+ years of experience.\n\nHow often are courses updated?\nCourses are constantly updated to align with global trends and best practices in Business Analysis.\n\nCan immigrants benefit from these programs?\nAbsolutely—Eno Eka specializes in helping immigrants secure professional jobs in Canada and globally, with tailored mentorship programs."
  }
  